[
    {
      "scene" : 1,
      "location" : "Living Room",
      "text" : "You wake up in a pool of vomit with a pounding headache and a pain in your abdomen from sleeping on a conch shell all night. Your cellphone is ringing.",
      "requirements" : [
        "cellphone"
      ]
    },
    {
      "scene" : 2,
      "location" : "Kitchen",
      "text" : "You hobble to the kitchen and make a beeline to the fridge. Fortunately, you bought groceries yesterday and managed to stock up on a selection of beverages. Time to start getting your life together and hydrate.",
      "requirements" : [
      ]
    },
    {
      "scene": 3,
      "location": "Master Bedroom",
      "text": "You enter your bedroom and almost scream in surprise at seeing a stranger snoring soundly in your bed. You wonder how they ended up here yet feel slightly annoyed that they took over your comfy Tempur-Pedic mattress instead of the couch. Rather than wake them up, you decide to maneuver around the room quietly.",
      "requirements": [
      ]
    },
    {
      "scene": 4,
      "location": "Bathroom",
      "text": "Looking at the mirror, you grimace at how much of a mess you look. Not only that, but you become aware of the unpleasant odor emanating from yourself after taking a whiff of air. Did you even shower the whole week? Disgusting. Go take a shower and make yourself look presentable.",
      "requirements": [
      ]
    },
    {
      "scene": 5,
      "location": "Master Bedroom",
      "text": "You go back to your room and see that the stranger is still passed out on your bed. If it weren't for the sounds of their snore, you would have thought they were dead. Time to dress up. Make sure to pick the appropriate outfit for the gig. You'll also need to find your guitar.",
      "requirements": [

      ]
    },
    {
      "scene": 7,
      "location": "Master Bedroom",
      "text": "Looking spiffy, if you say so yourself. The only thing left is to find your car keys so you can actually drive to the venue. You curse at your own forgetfulness as you can't remember the last place you put it. Better get a move on.",
      "requirements": [
        "guitar",
        "leather jacket"
      ]
    },
    {
      "scene": 8,
      "location": "Backyard",
      "text": "Although the chances of your car keys being here is low, with how wild last night was, you wouldn't be surprised about finding them in this place.",
      "requirements": [
        "guitar",
        "leather jacket"
      ]
    },
    {
      "scene": 9,
      "location": "Garage",
      "text": "Your magnificent carriage awaits. With your car keys finally in hand, you unlock the trunk and place your guitar. Putting the key in the ignition, she roars to life and you're able to exit the garage. \n Congrats on making it through this level! Now go be the rockstar you were meant to be.",
      "requirements": [
        "car keys"
      ]
    }
  ]